In [75]:
import pandas as pd
import numpy as np

In [76]:
df1= pd.read_csv("name.basics.tsv", sep='\t')

In [77]:
df1.head(3)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0050419,tt0053137,tt0043044"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0117057,tt0037382,tt0071877,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0049189,tt0059956,tt0057345,tt0054452"

In [147]:
df2 = pd.read_csv("title.akas.tsv", sep = '\t', na_values=["\\N"])

In [79]:
df2.head(3)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0

In [104]:
df3 = pd.read_csv("title.basics.tsv", sep='\t', na_values=["\\N"])

In [105]:
df3.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894.0,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892.0,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892.0,NaN,4,"Animation,Comedy,Romance"

In [82]:
df4 = pd.read_csv("title.crew.tsv", sep = '\t')

In [83]:
df4.head(3)

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N

In [84]:
df5 = pd.read_csv("title.episode.tsv", sep = '\t')

In [85]:
df5.head(3)

      tconst parentTconst seasonNumber episodeNumber
0  tt0041951    tt0041038            1             9
1  tt0042816    tt0989125            1            17
2  tt0042889    tt0989125           \N            \N

In [86]:
df5.isnull()

         tconst  parentTconst  seasonNumber  episodeNumber
0         False         False         False          False
1         False         False         False          False
2         False         False         False          False
3         False         False         False          False
4         False         False         False          False
...         ...           ...           ...            ...
4835378   False         False         False          False
4835379   False         False         False          False
4835380   False         False         False          False
4835381   False         False         False          False
4835382   False         False         False          False

[4835383 rows x 4 columns]

In [87]:
df6 = pd.read_csv("title.principals.tsv", sep = '\t')

In [88]:
df6.head(3)

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N

In [89]:
df7 = pd.read_csv("title.ratings.tsv", sep = '\t')

In [90]:
df7.head(3)

      tconst  averageRating  numVotes
0  tt0000001            5.6      1613
1  tt0000002            6.0       197
2  tt0000003            6.5      1294

In [91]:
df1.shape

(10080496, 6)

In [92]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10080496 entries, 0 to 10080495
Data columns (total 6 columns):
nconst               object
primaryName          object
birthYear            object
deathYear            object
primaryProfession    object
knownForTitles       object
dtypes: object(6)
memory usage: 461.4+ MB

In [93]:
df3['titleType'].unique()

array(['short', 'movie', 'tvMovie', 'tvSeries', 'tvEpisode', 'tvShort',
       'tvMiniSeries', 'tvSpecial', 'video', 'videoGame'], dtype=object)

In [94]:
df1.loc[100:110]

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
100,nm0000101,Dan Aykroyd,1952,\N,"writer,actor,producer","tt0080455,tt0097428,tt0087332,tt0118747"
101,nm0000102,Kevin Bacon,1958,\N,"actor,producer,soundtrack","tt0087277,tt0361127,tt0327056,tt0164052"
102,nm0000103,Fairuza Balk,1974,\N,"actress,soundtrack","tt0089908,tt0115963,tt0120586,tt0181875"
103,nm0000104,Antonio Banderas,1960,\N,"actor,soundtrack,producer","tt0120657,tt1189073,tt0285823,tt0120746"
104,nm0000105,Adrienne Barbeau,1945,\N,"actress,soundtrack","tt0090685,tt0080749,tt1024648,tt0082340"
105,nm0000106,Drew Barrymore,1975,\N,"producer,actress,soundtrack","tt0343660,tt0151738,tt0160127,tt0120631"
106,nm0000107,Kim Basinger,1953,\N,"actress,soundtrack,producer","tt0119488,tt0096895,tt0337921,tt0108525"
107,nm0000108,Luc Besson,1959,\N,"writer,producer,director","tt2872732,tt0100263,tt0119116,tt0110413"
108,nm0000109,Yasmine Bleeth,1968,\N,actress,"tt0119271,tt0115285,tt0131857,tt0337851"
109,nm0000110,Kenneth Branagh,1960,\N,"actor,producer,director","tt0116477,tt0097499,tt0107616,tt3402236"
110,nm0000111,Matthew Broderick,1962,\N,"actor,soundtrack,director","tt0086567,tt0395251,tt0091042,tt0115798"

In [95]:
df1.describe()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
count,10080496,10080496,10080496,10080496,8025581,10080496
unique,10080496,7892970,488,428,19883,4216735
top,nm2113875,David Smith,\N,\N,actor,\N
freq,1,315,9579104,9903334,1829774,1757543

In [96]:
df1

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0050419,tt0053137,tt0043044"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0117057,tt0037382,tt0071877,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0049189,tt0059956,tt0057345,tt0054452"
3,nm0000004,John Belushi,1949,1982,"actor,soundtrack,writer","tt0078723,tt0077975,tt0072562,tt0080455"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0060827,tt0050976,tt0050986,tt0083922"
...,...,...,...,...,...,...
10080491,nm9993714,Romeo del Rosario,\N,\N,"animation_department,art_department",tt2455546
10080492,nm9993716,Essias Loberg,\N,\N,NaN,\N
10080493,nm9993717,Harikrishnan Rajan,\N,\N,cinematographer,tt8736744
10080494,nm9993718,Aayush Nair,\N,\N,cinematographer,\N
10080495,nm9993719,Andre Hill,\N,\N,NaN,\N

In [106]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6790810 entries, 0 to 6790809
Data columns (total 9 columns):
tconst            object
titleType         object
primaryTitle      object
originalTitle     object
isAdult           int64
startYear         float64
endYear           float64
runtimeMinutes    object
genres            object
dtypes: float64(2), int64(1), object(6)
memory usage: 466.3+ MB

In [98]:
df3["startYear"].isna().sum()

0

In [99]:
df3['startYear'].replace('\\N', np.NaN)

0          1894
1          1892
2          1892
3          1892
4          1893
           ...
6790805    2010
6790806    2010
6790807    2010
6790808    2015
6790809    2014
Name: startYear, Length: 6790810, dtype: object

In [107]:
df3["startYear"].fillna(0, inplace=True)

In [108]:
df3.loc[65779]

tconst              tt0067098
titleType           tvEpisode
primaryTitle      Willi Forst
originalTitle     Willi Forst
isAdult                     0
startYear                   0
endYear                   NaN
runtimeMinutes             55
genres                    NaN
Name: 65779, dtype: object

In [66]:
#df3.drop(index=[69772], inplace=True)

In [112]:
df3["startYear"] = pd.to_numeric(df3["startYear"])

In [115]:
df3.loc[(df3['titleType'] == 'movie') & (df3['startYear'] > 1900)]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
499,tt0000502,movie,Bohemios,Bohemios,0,1905.0,NaN,100,NaN
571,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906.0,NaN,70,"Biography,Crime,Drama"
611,tt0000615,movie,Robbery Under Arms,Robbery Under Arms,0,1907.0,NaN,NaN,Drama
626,tt0000630,movie,Hamlet,Amleto,0,1908.0,NaN,NaN,Drama
669,tt0000675,movie,Don Quijote,Don Quijote,0,1908.0,NaN,NaN,Drama
...,...,...,...,...,...,...,...,...,...
6790699,tt9916622,movie,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,0,2015.0,NaN,57,Documentary
6790726,tt9916680,movie,De la ilusión al desconcierto: cine colombiano...,De la ilusión al desconcierto: cine colombiano...,0,2007.0,NaN,100,Documentary
6790738,tt9916706,movie,Dankyavar Danka,Dankyavar Danka,0,2013.0,NaN,NaN,Comedy
6790749,tt9916730,movie,6 Gunn,6 Gunn,0,2017.0,NaN,116,NaN
6790760,tt9916754,movie,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,0,2013.0,NaN,49,Documentary

In [73]:
#rawfile = pd.read_csv("title.basics.tsv", sep='\t', na_values=["\\N"])

In [119]:
#rawfile

In [116]:
df1.head(3)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0050419,tt0053137,tt0043044"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0117057,tt0037382,tt0071877,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0049189,tt0059956,tt0057345,tt0054452"

In [135]:
df2.head(3)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0.0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0.0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0.0

In [118]:
df2['region'].unique()

array(['UA', 'DE', 'HU', 'GR', 'RU', 'US', '\\N', 'JP', 'FR', 'RO', 'GB',
       'PT', 'ES', 'UY', 'IT', 'FI', 'RS', 'PL', 'AR', 'BR', 'XWW', 'DK',
       'TR', 'XEU', 'SK', 'CZ', 'SE', 'MX', 'XYU', 'AT', 'VE', 'CSHH',
       'SI', 'AU', 'CA', 'NL', 'LT', 'NO', 'IR', 'CO', 'BG', 'TW', 'BE',
       'IN', 'DZ', 'CH', 'NZ', 'BF', 'XWG', 'VN', 'XSA', 'SUHH', 'EE',
       'IS', 'HR', 'DDDE', 'XKO', 'CL', 'EG', 'HK', 'BY', 'GE', 'BA',
       'PE', 'PA', 'CN', 'TJ', 'XSI', 'YUCS', 'IE', 'IL', 'LV', 'CU',
       'AL', 'BO', 'ZA', 'KR', 'MY', 'SG', 'BUMM', 'XPI', 'BJ', 'PR',
       'CM', 'AZ', 'TH', 'DO', 'EC', 'MA', 'GL', 'LI', 'LU', 'PH', 'ID',
       'PY', 'MZ', 'BM', 'JM', 'MD', 'CR', 'GT', 'LB', 'IQ', 'TM', 'MK',
       'TN', 'NG', 'HT', 'SN', 'GH', 'CI', 'JO', 'KG', 'PK', 'LK', 'NE',
       'GN', 'VDVN', 'TD', 'SO', 'SD', 'MC', 'CG', 'TT', 'GA', 'BS', 'LY',
       'SY', 'AO', 'KH', 'SV', 'MR', 'AF', 'MG', 'ML', 'GY', 'CY', 'ET',
       'GU', 'XAS', 'UZ', 'SR', 'MT', 'AM', 'TG', 'PG', 'MU', 'BI', 'CF',
       'NI', 'ZW', 'BD', 'ZM', 'GW', 'DJ', 'KP', 'RW', 'TZ', 'KZ', 'GI',
       'LA', 'SC', 'NP', 'GP', 'MN', 'SM', 'CD', 'CSXX', 'TO', 'AW', 'BT',
       'LS', 'HN', 'KE', 'MQ', 'KW', 'AD', 'SA', 'ZRCD', 'AE', 'PS', 'ER',
       nan, 'IM', 'XKV', 'BH', 'BB', 'BZ', 'CV', 'UG', 'AG', 'NU', 'OM',
       'QA', 'BW', 'SL', 'MO', 'LR', 'VC', 'AN', 'MV', 'YE', 'GM', 'KY',
       'PF', 'MM', 'ME', 'NC', 'DM', 'MP', 'FO', 'VA', 'GQ', 'FJ', 'SZ',
       'RE', 'EH', 'VG', 'LC', 'MW', 'BN', 'TL', 'ST', 'KM', 'FM', 'MH',
       'VI', 'XNA', 'GF', 'VU', 'SH', 'MS', 'WS', 'TV', 'XAU', 'CK', 'AQ',
       'PW', 'NR', 'GD', 'KN', 'AS', 'SB', 'JE', 'KI', 'AI', 'TC'],
      dtype=object)

In [148]:
df2 = df2.loc[(df2['region'] == 'US') | (df2['region'] == 'GB') | (df2['region'] == 'FR') ]

In [141]:
df2['isOriginalTitle'].unique()

array([ 0., nan,  1.])

In [149]:
df2.drop(columns=['language','types','attributes','isOriginalTitle'], inplace=True)

In [150]:
df2.head(3)

      titleId  ordering                   title region
5   tt0000001         6              Carmencita     US
10  tt0000002         3  Le clown et ses chiens     FR
14  tt0000002         7  The Clown and His Dogs     US

In [151]:
df1.head(3)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"soundtrack,actor,miscellaneous","tt0072308,tt0050419,tt0053137,tt0043044"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack","tt0117057,tt0037382,tt0071877,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,soundtrack,producer","tt0049189,tt0059956,tt0057345,tt0054452"

In [158]:
result = pd.concat([df1, df2], axis=1, join='inner')

In [159]:
result.head(10)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles,titleId,ordering,title,region
5,nm0000006,Ingrid Bergman,1915,1982,"actress,soundtrack,producer","tt0034583,tt0036855,tt0038109,tt0038787",tt0000001,6,Carmencita,US
10,nm0000011,Gary Cooper,1901,1961,"actor,soundtrack,producer","tt0034167,tt0035896,tt0027996,tt0044706",tt0000002,3,Le clown et ses chiens,FR
14,nm0000015,James Dean,1931,1955,"actor,miscellaneous","tt0048545,tt0049261,tt0044245,tt0048028",tt0000002,7,The Clown and His Dogs,US
21,nm0000022,Clark Gable,1901,1960,"actor,soundtrack,producer","tt0031381,tt0025316,tt0023382,tt0026752",tt0000003,6,Poor Pierrot,GB
22,nm0000023,Judy Garland,1922,1969,"soundtrack,actress","tt0037059,tt0032138,tt0055031,tt0047522",tt0000003,7,Pauvre Pierrot,FR
27,nm0000028,Rita Hayworth,1918,1987,"actress,soundtrack,producer","tt0036723,tt0038559,tt0040552,tt0040525",tt0000004,4,Un bon bock,FR
32,nm0000033,Alfred Hitchcock,1899,1980,"director,producer,actor","tt0052357,tt0040746,tt0053125,tt0054215",tt0000005,10,The Blacksmith's Forge,GB
33,nm0000034,William Holden,1918,1981,"actor,soundtrack","tt0074958,tt0046359,tt0043014,tt0072308",tt0000005,1,Blacksmithing Scene,US
35,nm0000036,Buster Keaton,1895,1966,"actor,writer,director","tt0019421,tt0015324,tt0016332,tt0017925",tt0000005,3,Blacksmith Shop,GB
36,nm0000037,Gene Kelly,1912,1996,"soundtrack,actor,director","tt0045152,tt0041716,tt0043278,tt0053946",tt0000005,4,Blacksmith Scene #1,US